[
    {
        "type": "message",
        "user": "U2BR1HW2V",
        "text": "<@U2C2QB893> what all functionality are you working on for the app?",
        "ts": "1477938265.000020"
    },
    {
        "type": "message",
        "user": "U2C2QB893",
        "text": "<@U2BR1HW2V>  the app is supposed to tie into a smart home. There is supposed to be a login page but idk how to do that yet. The heating. U go in, change the temp, up or down. There is a submit button within which should save the temperature number and return it to the main page but dont got that yet. The lighting should show every room within the house and weather ir not the lights are on or off. Then be allowed to turn them on or off. Then push notifications if they have been on for x time but that is not in 30th tutorials they got lol. The appliances are supposed to show appliances and their states.  I.e. smart tvs, coffee makers, wireless printers etc. Then be able to do x or y with specific appliances. The log out. Should logout and quit the app. Still alot to do. But I got like no expierence... learning tho.",
        "ts": "1477944024.000021"
    },
    {
        "type": "message",
        "user": "U2BQQPXHA",
        "text": "You can use either Backendless or Firebase to handle things in the cloud",
        "ts": "1477944161.000022"
    },
    {
        "type": "message",
        "user": "U2BQQPXHA",
        "text": "For a local db I recommend learning Realm.",
        "ts": "1477944182.000023"
    },
    {
        "type": "message",
        "user": "U2BR1HW2V",
        "text": "<@U2C2QB893> sounds like it should cover most aspects of building an app. I agree with Phils recommendations for databases. Backendless and Firebase both handle logins very easily.",
        "ts": "1477945196.000024"
    },
    {
        "type": "message",
        "user": "U2C2QB893",
        "text": "Didnt plan on tying it into a db but.... ",
        "ts": "1477946079.000025"
    },
    {
        "type": "message",
        "user": "U2BQQPXHA",
        "text": "Then I would recommend just using realm. Creating a low level login that's not secure shouldn't be difficult. ",
        "ts": "1477946335.000026"
    },
    {
        "type": "message",
        "user": "U2C2QB893",
        "text": "*thumbs up emoji",
        "ts": "1477954343.000027"
    },
    {
        "type": "message",
        "user": "U2C2ZH39R",
        "text": ":thumbsup:",
        "ts": "1477954464.000028"
    }
]